import React from 'react';
import Header from '../Components/Header';
import Back from 'react-icons/lib/md/navigate-before';

const 难搭配的字 = () => (
  <div className='article-page'>
    <Header leftIcon={<Back/>} leftLink={'/settings'} title='难搭配的字' headingLevel={3}/>
    <article>
      <h4>以下字被标有[人脑可以驾驭, 电脑不行]的标签:</h4>
      <p>直枉枢板或郁矿奇顷转逛狸十七八凌匕桨了高座丈唐瓷凉站竞部阅亿拳烧酒消涧浪浸悄悍悔家宵扇袖袍调谈叔肯具果迪帖罗帕岭图迭氛垂叉支不太车巨牙比互止少日中贝内长剧陶难预理排赦掀教掠接掷掘侍例侣侨质征所舍周什仅介乏六斗订认引勘著萄萤营梯梭厢昏鱼备庞府底郊刻炊沫泪注泣击甘节本布且甲申沸怔怜宗帘肩衫视话录屉生矢失禾付丛甩包写让议眶眯眼略崎帷崛婴圈笛笙驻奏拭持项挟拽挺括尼弗边对幼邦老场耳共机符偿偶偎假得衔盘斜欲领脸象祭烹庵鹿竟族剪淳惋页夸列划岂网朱指拯某荆茸带荒茫荡荧标查柠寄寂宿密弹续骑绽款堪塔迁传伏伐伤份仿伞创旨各争砌面残省昧眨昭虽响趋握联葡椰交妄闭并关米州池讲许论诀尽导阵收阴防钦拜段俏皇妃好巡形吞扶技找走贡攻均惑暂翘悲掌暑最盾须叙胆蚀弯闺差抛投坊报杖更束否还喧嵌幅稍程等答养类首总炼洞测浓津恢举循腊脾馈装就敦童羡普遂港渤溅渲祠误说诵退既绒结给统肖呈里吼别每慨裙谢谣属疏登编魂摄栽赶袁都热壶埃恭体何但作返坐妥饮系状填鼓摆斟幕蓄献禁概感碎龄睹档株校索速础虑紧逞晒晃冷判汪汰泛没忧证识诉睬嗜盟跟置蜀锚稚简催圆氧敌秘词即尾改陆坠忍驱纵纺奉卦像愈猿数坦担顶拥势拦招披取倘俱倡候俯倍倦射躬徒徐拿耸塑满滔漓滚寞寝褂叠摹榴需裳蜡锻稳管魅貌鲜裹竭粹熄漱滴演慷察谭褪撒播擒撰横橡碾瞒题暴踏嘱黎箱摩潮潭懂慰豫撼薄橙整霍辙穆篷雕鲸辩糖激懒鞠藏簇繁徽翻瀑曝靡疆札阮丞纨呓町伽彷邸饫沌汩怃忡怅玡咆咛帔侃诠弩驽驷柚轲昵胄咤钛俨舢恓陛莅荼桉栩砺虔舫恙涅涓袢娲匮晤铮偕舷悱袈殚铿筌遑遁腑湍湄蒿楣蜃雎跹飕裔煅裾榛睽暧箸塾嫡缪蕨幡嶙镏熵潺樵醍飙霖瞥襄鬃麝蘸</p>
    </article>
  </div>
);

export default 难搭配的字;
