{
  "男孩用": "茂松刺斩狼匕高力斋士丈山川拳广浩悍宽叔虎昌昂岩岭凯飞叉戈气升骏掀据岳朋勘械硅彪河本厉电波宙玄汉啸崖崇崛驹城辽矛扛舵康兽混惊屹刚廷荡荣柏柱屠伟杀兆壮厚战勋庆闯宇峡钢钧段侯驰寿攻孝雄雳胆峦苍克杉励铸洪艇渤湃逊勇歼岗兵裕禄瑞秦栽莽晋伯狂搏蓬雷督破判沧催峨峰峻铁武规拓鹏腾猿射舰豹滔墙赫锻敲豪察鞍霄鲨憨劈擂擎翰雕鹰巅疆巍霸霹弋驭犷钊邸亨炀咆岿岱枭宕驽驷胄峋恺羿骁骅砺砥罡钵铀隼桀蚩骋铠铮烽翌戟傥谡嗣煅霆辕踞嶙磐麾樵橹磺飙噬翱鲲犟濠鬃麒骥",
  "女孩用": "若苹苑枝雨软狸恋瓷粉袖氛艺娟娥绢丹凤菱菲萌萝萄菩萍萤梦梧梅梳雪兔饰泪巧兰曼甜妮珊尼丝芝敏彩猫凰鹿羚剪淑情贞茸茵荧荔柳柠婉绵绽琳琼款朵妆鸥虹葫葡葵棉香俏妃红纤玛惠雁颊紫棠晴晶鹃亭亮姿闺芙花芹芬芳芭杏筝美恬宫湘眉娇娜柔绒绚牡裙媚瑰艳珠莲莉荷莹莺彤蓉楚雾株桃唇暖妙妖纱玫腮茉静碧蔓榴榕裳舞魅漾蕊樱豌蝶颜翩燕蕾薇橙橘糖霞穗馨露汀芊芍曳芸芷伽妍妩玥苓囹妲姗珂珀茜茱荞茯荃茹柚栀昵飒袂郡娆姝姣姹矜绛珞琤莓荼莎桉胭袅恣娑涓窈娲娴娓婀菁萘菏菀桫帼笞皎鸾旎窕婧婕婵绫绮绯绻绾琪瑛靓琬琛萼葩葶葭雯喃嵋湉湄媛婷瑚蓓蒡颐楠嗔滟裟愫裾嫒瑶蔷蔻暧幔僖旖漪漩嫣嫚璎璇蕙蕨靥鹞霓璐薰黛镯馥蘅颦麝",
  "很土": "茂杰奋力大涛浩海祥虎昆国明忠凯飞娟娥绣欣朋丹凤萍彪东帅波诚建晨春民吉敏康贞团帆刚柱威伟华壮贵超博喜庆军钢顺红惠雄辉棠鹃俊胜亮志芙花芹芳劳丽锋锐洁娇娜勇耘岗牡秀兵富裕禄强瑞艳珠振莉彤勤蓉晓宏键峰铁鹏新健福静翠慧聪蝶德毅燕穗玮姗茜菏靓婷楠",
  "略土": "英枝松山益广悦旺鸣王艺展祟通绢骏捷金菱梅爽河巧甘宝宙实详冬立跃崇甜妮玲珊辽发淑光屹荣栋柏勃婉绵琳琼优兆旭敬朝江兴宇香保寿韧孝晶峦亭芬杏杉杨辰皓美洪洋贺骄坚耿莲荷莺雷桂桃良锦峻纬玫腾颖靖坤茉缤碧彰蕊震蕾霞璧耀巍芊芍芸妍妩茱荃茹姣莓莎倩胭娴婀菁铠皎烽婕葶雯媛瑚蓓韬翡璠犟璐麒",
  "很俗": "佳宁驹哲嘉豪昊昕炜莘琛睿",
  "略俗": "川益朗迪丰捷彬龙泽宜铭逸鸿渊涵迅信克辰智竣轩谦媚桦启峻劲航熙翰馨岚钊弈奕帼铠琦慊鲲寰濠瀚曦懿",
  "无趣": "苹茁板杭事一厂凌衷高乃才丈万凡益兼义悍宽诺谅谊贤昌畅固咏岩岭制卫刃习叉井元专木友巨仁恳陶能继培和秉岳丹方计尺允双菲营彬硕盛雪堂法卉功艾石龙平北田史治宗定肃禾代尔乐玄汉礼常绅驶辽加邦亚芝权协庸成尧尖早同廷革茵荫栋勃柬伍伦全厚鸥盼显品勋敬棕决汝弛阳钧矩禹好驰寿麦远运厦雳敞践律勉施严芦芭材杖励策济艇鲁馈敦渤冠祖逊垒坚旷利愉瑟载挚耿恭蒙献楷榄槐碑督桦虑庐辛汪沛睦跨峨积秩称阿附武规坤倡舰豹颂滨誉谨赫聚锻稳箫旗慷褐增樟磊霄澄憨豫辙赞儒瞩曙徽赢翼鹰露霹韦仞芍攸佗饫岿岱佼珏赳茱荟茗柯轶胄笃俨炳炯洱骅彧砺砥轼虔罡隼舫烨涟涓窈掊萃菀铮笞舸鸾旌窕绫琵琮萼掣犊筌傥舜谡媛蒿颐榈煦跻嗣嵩詹雍阙缜韬榛霆裴幛骠璋嶙镏羯磬橹霖翱羲寰襄鬃躇骥骧",
  "略生僻": "苑顷逛壬琅侈刹乾庚怡诞匙笙迢挟徘徙羚淳屹茬祷堰椎峡钦玖喻赋柒竣羡渲瑟酌沁稚圃魁坦坤徒彰撰蕊幢澄踱瞭弋札丕仞玑亘夙坂抉芷芮佚奂狄炀汾忡怆纾玥玦苒苓杳鸢岿岬帔迤枭炜炝泱泓泾祇诣诩妲绉驿珐玳荞茯荏荃垩殇轲胄咤峒峋逅奕飒炯洱恓恺衿袂咫娆姝羿骁骅绛珥珞琤敖莅荼桓彧逦唏罡铄氤倏隽徕桀朔烨浯悭袢奘蚩骋掬掊菁萘萃萦桫晡晤晗皑舸翎孰翊旎袤焐焓渚淞悱婧翌绮绻绾缁琮葭殚斐犊鹄遑颌湛湮湍谡瑜蒿蒡楣裘蜃虞雎戥雉氲筠筱颔阙煨煺滟愫骞媲嫒璈榭霁踌僖銮塾韶旖漪骠璀墀蕙靥幡镌镏箴篆鹞馔麾熵熠潺憬熨璞靛璠熹磬醍邂羲燧寰缱璨檄翳簌皤鹫鬃曜鎏蘅霭霰骧颦灏",
  "略怪": "直枉枢板或郁矿奇顷转逛狸十七八凌匕桨了高座丈唐瓷凉站竞部阅亿拳烧酒消涧浪浸悄悍悔家宵扇袖袍调谈叔肯具果迪帖罗帕岭图迭氛垂叉支不太车巨牙比互止少日中贝内长剧陶难预理排赦掀教掠接掷掘侍例侣侨质征所舍周什仅介乏六斗订认引勘著萄萤营梯梭厢昏鱼备庞府底郊刻炊沫泪注泣击甘节本布且甲申沸怔怜宗帘肩衫视话录屉生矢失禾付丛甩包写让议眶眯眼略崎帷崛婴圈笛笙驻奏拭持项挟拽挺括尼弗边对幼邦老场耳共机符偿偶偎假得衔盘斜欲领脸象祭烹庵鹿竟族剪淳惋页夸列划岂网朱指拯某荆茸带荒茫荡荧标查柠寄寂宿密弹续骑绽款堪塔迁传伏伐伤份仿伞创旨各争砌面残省昧眨昭虽响趋握联葡椰交妄闭并关米州池讲许论诀尽导阵收阴防钦拜段俏皇妃好巡形吞扶技找走贡攻均惑暂翘悲掌暑最盾须叙胆蚀弯闺差抛投坊报杖更束否还喧嵌幅稍程等答养类首总炼洞测浓津恢举循腊脾馈装就敦童羡普遂港渤溅渲祠误说诵退既绒结给统肖呈里吼别每慨裙谢谣属疏登编魂摄栽赶袁都热壶埃恭体何但作返坐妥饮系状填鼓摆斟幕蓄献禁概感碎龄睹档株校索速础虑紧逞晒晃冷判汪汰泛没忧证识诉睬嗜盟跟置蜀锚稚简催圆氧敌秘词即尾改陆坠忍驱纵纺奉卦像愈猿数坦担顶拥势拦招披取倘俱倡候俯倍倦射躬徒徐拿耸塑满滔漓滚寞寝褂叠摹榴需裳蜡锻稳管魅貌鲜裹竭粹熄漱滴演慷察谭褪撒播擒撰横橡碾瞒题暴踏嘱黎箱摩潮潭懂慰豫撼薄橙整霍辙穆篷雕鲸辩糖激懒鞠藏簇繁徽翻瀑曝靡疆札阮丞纨呓町伽彷邸饫沌汩怃忡怅玡咆咛帔侃诠弩驽驷柚轲昵胄咤钛俨舢恓陛莅荼桉栩砺虔舫恙涅涓袢娲匮晤铮偕舷悱袈殚铿筌遑遁腑湍湄蒿楣蜃雎跹飕裔煅裾榛睽暧箸塾嫡缪蕨幡嶙镏熵潺樵醍飙霖瞥襄鬃麝蘸",
  "很怪": "苗茅杯析枪构刺枣欧轮脑乙狼厂卜几刁准三干症土脊寸效资巾个瓶勺丸烘递涡浴涨涩宾窍窄被些尚咐账马区瓦手壬夭剥验球措掩掉堆推授委供侦货侈迫片仇币斤仓欠匀勾亢户巴孔劝刊基勒械检曹票奢盔辅兔狐京庙庚盲育闸闹郑卷泡泻扑厉卡叩另泳泥沼怪宠官房衬诞询该届弧孟乍丘仗们斥句册务市头讨训睁距累患崩铲矫降函限线组细绊驼贯帮拱挡司皮矛扛扩臣第做售偏船盒够猫减毫麻廊章商率盖粗粒兽添混淤淀渗惭惕匠夺夷邪尖吕吊吃吸拾挤拼茬荐荔枯柿咸研厘惯谚屠隋隆颇颈绩综巢替搭堰迄优件血企危旬负耐耍轴鸦背竖削哄冒咽哗趁揽堤葫惹募葛棱棵次产决羊汤宅设访那炭骨钮卸看种科竿促俄鬼侵禹级纫戒抚坛扰拒址扯抄坝抢棘酥确裂辈凿敞晾遗蜒很胞狭狠怨急饶奖抗块扭芦芯杆杜甫两啼赎黑铺销掰毯筋傅牌堡集焦街洼浇活派恃室突诫番腕阔滋祝诱垦屋陨架怠歼旱盯吴助围困员岖帐针告我乱窜屡隔隙缎肆班匿顽捕捎捍捐捡换耽莱晋估低位皂役余岔免角条冻况床库搬搞聘蓬蒸榆酬碑频格核根翅较顿柴桌监哮疗冶兑沥沃沈社瞄跨遣署罪幌错锤愁哭钻造秤值倒局陈阻妖驳纽玩环武抹拢拔腮触解雏廓拖拎抵拘抱拉抬倔殷颁脆滤溢滩慎塞谬缚缝缠墙墟摧截撇蔽蔼模榜碟磁辖辗颗舆僧疑敲遮端精漆寨撕趣撑撬撞鞍橄豌嘻幢镇靠稽躺艘褒糊鲨澳额谴憨劈履擂擅颠橘踱器赞篮篱磨糕憾懈壁避檬檐礁瞧簇戳警蘑藻攀蹬颤瓣壤籍灌譬霸髓兀卞尹丕驭伫犷汲忏阮抉芡佗狄邹亨羌诏陀纶耶岬迥囹帛炝泾宕诧孢迦绉垩眈盅峒皈轼唔钵烩掬掖蛊孰烯惘悸缁葩锃犄釉貂觞惺缄虞暌跻煲詹煺媲墉榻蜿幛箍箔儆潢蕃馔嬉耨鞘樽磺瞠膳禧檄蹊羁膻攒蹴攘癫",
  "多音字": "枉奇转了干症涨扇调区车少中长剥难教迫舍仇为斗订乾盛卷泡卡乐跃累圈降参拱发地假得率当曲查宿弹骑传任血行创省削哄咽朝兴重凿量将差还济遂曾冠肖都角系禁校没称倒阿劲解数缝鲜澄藏攒"
}