db.names.find({labels: 
  {
    $in: ['有意思', '优先'], 
    $nin: ['很土', '略土', '很俗', '略俗', '很怪', '略怪', '略生僻', '女孩用', '男孩用', '不适用于人名', '多音字', '无趣', '很生僻']
  }
});

db.names.find(
{labels: 
  {
    $in: ['普通'], 
    $nin: ['很土', '略土', '很俗', '略俗', '很怪', '略怪', '略生僻', '女孩用', '男孩用', '不适用于人名', '多音字', '无趣', '很生僻']
  }
} 
);
db.names.find({ref: {$exists: true},labels: 
  {
    $in: ['普通'], 
    $nin: ['很土', '略土', '很俗', '略俗', '很怪', '略怪', '略生僻', '女孩用', '男孩用', '不适用于人名', '多音字', '无趣', '很生僻']
  } });

db.names.find({
  $and: [
  	{$or:[{ref: {$exists: true}}, {looseRef: {$exists: true}}]},
  	{labels:{
	  $in: ['普通'], 
	  $nin: ['很土', '略土', '很俗', '略俗', '很怪', '略怪', '略生僻', '女孩用', '男孩用', '不适用于人名', '多音字', '无趣', '很生僻']
	}}
  ]
});

db.names.find({
  $and: [
  	{$or:[{ref: {$exists: true}}, {looseRef: {$exists: true}}]},
  	{labels:{
	  $in: ['普通', '有意思', '优先'], 
	  $nin: ['很土', '略土', '很俗', '略俗', '很怪', '略怪', '略生僻', '女孩用', '男孩用', '不适用于人名', '多音字', '无趣', '很生僻']
	}}
  ]
});
 
db.names.find({name:'之在'}); 
  